Repository: Sokphirun99/KhmerLens
Catalog: lib/l10n/arb/app_*.arb
Languages: km

source: Scan Document
km: ស្កេនឯកសារ

source: All
km: ទាំងអស់

source: Saving...
km: កំពុងរក្សាទុក...

source: Error
km: មានបញ្ហា

source: Retry
km: ព្យាយាមម្តងទៀត

# emptyStateMessage
source: No documents
km: គ្មានឯកសារ

# emptyStateDescription
source: Tap the button below to start scanning
km: ចុចប៊ូតុងខាងក្រោមដើម្បីចាប់ផ្តើមស្កេនឯកសាររបស់អ្នក

source: Show All
km: បង្ហាញទាំងអស់

source: Delete Document
km: លុបឯកសារ

# deleteDocumentConfirmation
source: Are you sure you want to delete this document? This action cannot be undone.
km: តើអ្នកពិតជាចង់លុបឯកសារនេះមែនទេ? សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។

source: Delete
km: លុប

source: Cancel
km: បោះបង់

# shareComingSoon
source: Share feature coming soon
km: មុខងារចែករំលែកនឹងមកដល់ឆាប់ៗនេះ

# deletedSuccess
source: Document deleted
km: បានលុបឯកសារ

source: Settings
km: ការកំណត់

source: Back
km: ត្រឡប់ក្រោយ

source: Appearance
km: រូបរាង

source: Display Mode
km: របៀបបង្ហាញ

source: Light
km: ភ្លឺ

source: Dark
km: ងងឹត

source: System
km: ប្រព័ន្ធ

source: Choose Display Mode
km: ជ្រើសរើសរបៀបបង្ហាញ

source: Use device settings
km: ប្រើការកំណត់ពីឧបករណ៍

source: Language
km: ភាសា

source: Choose Language
km: ជ្រើសរើសភាសា

source: Khmer
km: ខ្មែរ

source: English
km: អង់គ្លេស

source: Storage
km: ទំហំផ្ទុក

source: Document Count
km: ចំនួនឯកសារ

source: documents
km: ឯកសារ

source: Counting...
km: កំពុងរាប់...

source: Storage Used
km: ទំហំផ្ទុកដែលប្រើ

source: Clear Cache
km: សម្អាតឃ្លាំង

# clearCacheSubtitle
source: Delete temporary data
km: លុបទិន្នន័យបណ្ដោះអាសន្ន

# clearCacheTitle
source: Clear Cache
km: សម្អាតឃ្លាំង

# clearCacheMessage
source: Are you sure you want to delete all temporary data? This will not delete your documents.
km: តើអ្នកពិតជាចង់លុបទិន្នន័យបណ្ដោះអាសន្នទាំងអស់មែនទេ? សកម្មភាពនេះនឹងមិនលុបឯកសាររបស់អ្នកទេ។

source: Clear
km: សម្អាត

source: Cache cleared
km: បានសម្អាតឃ្លាំង

source: Unable to calculate
km: មិនអាចគណនាបាន

source: About App
km: អំពីកម្មវិធី

source: App
km: កម្មវិធី

source: Version
km: កំណែ

source: License
km: អាជ្ញាប័ណ្ណ

source: Tap to view license
km: ចុចដើម្បីមើលអាជ្ញាប័ណ្ណ

source: Support
km: ជំនួយ

source: Rate App
km: វាយតម្លៃកម្មវិធី

# rateAppSubtitle
source: Help us improve with your rating
km: ជួយយើងកែលម្អដោយការវាយតម្លៃ

source: Share App
km: ចែករំលែកកម្មវិធី

# shareAppSubtitle
source: Tell your friends about this app
km: ប្រាប់មិត្តភក្តិអំពីកម្មវិធីនេះ

source: Report Bug
km: រាយការណ៍បញ្ហា

# reportBugSubtitle
source: Let us know if you encounter any issues
km: ប្រាប់យើងប្រសិនបើអ្នកជួបបញ្ហា

source: Privacy Policy
km: គោលការណ៍ភាពឯកជន

# featureComingSoon
source: This feature will be available soon
km: មុខងារនេះនឹងមានក្នុងពេលឆាប់ៗ

source: Preparing to share...
km: កំពុងរៀបចំឯកសារសម្រាប់ចែករំលែក...

# unableToShare
source: Unable to share document
km: មិនអាចចែករំលែកឯកសារ

source: Exporting PDF...
km: កំពុងនាំចេញជា PDF...

source: Unable to export PDF
km: មិនអាចនាំចេញជា PDF

source: Take Photo
km: ថតរូប

source: Choose from Gallery
km: ជ្រើសរូបពីវិចិត្រសាល

source: Adding images...
km: កំពុងបន្ថែមរូបភាព...

source: Unable to add images
km: មិនអាចបន្ថែមរូបភាព

# cannotDeleteLastImage
source: Cannot delete the last image
km: មិនអាចលុបរូបភាពចុងក្រោយបានទេ

source: Delete Image
km: លុបរូបភាព

# deleteImageConfirmation
source: Are you sure you want to delete this image?
km: តើអ្នកពិតជាចង់លុបរូបភាពនេះមែនទេ?

source: Unable to reorder images
km: មិនអាចរៀបចំរូបភាពឡើងវិញ

source: Add Images
km: បន្ថែមរូបភាព

source: Manage Images
km: គ្រប់គ្រងរូបភាព

source: Share
km: ចែករំលែក

# exportPdf
source: Export as PDF
km: នាំចេញជា PDF

source: No images in document
km: គ្មានរូបភាពក្នុងឯកសារ

# pleaseAddImages
source: Please add new images
km: សូមថែមរូបភាពថ្មី

source: Unable to load image
km: មិនអាចផ្ទុករូបភាព

source: Document Info
km: ព័ត៌មានឯកសារ

source: General Info
km: ព័ត៌មានទូទៅ

source: Created
km: បង្កើត

source: Expires
km: ផុតកំណត់

source: Technical Info
km: ព័ត៌មានបច្ចេកទេស

source: Images
km: រូបភាព

# imageCount
source: {count} images
km: {count} រូប

source: Unable to load
km: មិនអាចផ្ទុក

source: Loading...
km: កំពុងផ្ទុក...

source: Size
km: ទំហំ

source: Add
km: បន្ថែម

source: No camera found
km: រកមិនឃើញកាមេរ៉ា

# cameraInitError
source: Unable to initialize camera
km: មិនអាចចាប់ផ្តើមកាមេរ៉ាបានទេ

# imageCaptured
source: Image {count} captured
km: រូបភាពទី {count} ត្រូវបានថតរួច

source: Finish
km: បញ្ចប់

# captureError
source: Unable to capture image
km: មិនអាចថតរូបភាពបានទេ

source: Flash On
km: បើកភ្លើង

source: Flash Off
km: បិទភ្លើង

# singlePageMode
source: Single Page (Fast)
km: ម៉ូដទំព័រតែមួយ (រហ័ស)

# multiPageMode
source: Multi Page
km: ម៉ូដច្រើនទំព័រ

# pickImageError
source: Unable to pick images
km: មិនអាចជ្រើសរូបភាពបានទេ

source: Starting camera...
km: កំពុងចាប់ផ្តើមកាមេរ៉ា...

# alignDocument
source: Align document within the frame
km: រៀបចំឯកសារក្នុងក្របនេះ

source: Close
km: បិទ

# modeSingle
source: One
km: ១រូប

# modeMulti
source: Multi
km: ច្រើន

source: Image deleted
km: រូបភាពត្រូវបានលុបចេញ

# documentPrefix
source: Document
km: ឯកសារ

# searchDocumentsHint
source: Search documents...
km: ស្វែងរកឯកសារ...

source: Searching...
km: កំពុងស្វែងរក...

source: Search error
km: កំហុសក្នុងការស្វែងរក

# foundResults
source: Found {count} results
km: រកឃើញ {count} លទ្ធផល

source: Cannot delete document
km: មិនអាចលុបឯកសារ

# deletedSuccessfully
source: Document deleted successfully
km: បានលុបឯកសារដោយជោគជ័យ

source: Expired
km: ផុតកំណត់

# expiresOn
source: Expires {date}
km: ផុតកំណត់ {date}

source: Search tips
km: ការណែនាំស្វែងរក

# searchByTypeOrText
source: Search by document type or scanned text
km: ស្វែងរកតាមប្រភេទឯកសារ ឬអត្ថបទដែលបានស្កេន

source: Search by type
km: ស្វែងរកតាមប្រភេទ

source: Recent searches
km: ស្វែងរកថ្មីៗ

source: Type to search
km: វាយបញ្ចូលដើម្បីស្វែងរក

# searchByNameOrText
source: Search by document name or scanned text
km: ស្វែងរកតាមឈ្មោះឯកសារ ឬអត្ថបទដែលបានស្កេន

source: No results found
km: រកមិនឃើញឯកសារ

# tryDifferentKeywords
source: Please try different keywords
km: សូមព្យាយាមស្វែងរកពាក្យផ្សេងទៀត

# categoryIdCard
source: ID Card
km: អត្តសញ្ញាណប័ណ្ណ

# categoryPassport
source: Passport
km: លិខិតឆ្លងដែន

# categoryDriverLicense
source: Driver's License
km: ប័ណ្ណបើកបរ

# categoryInvoice
source: Invoice
km: វិក្កយបត្រ

# categoryContract
source: Contract
km: កិច្ចសន្យា

source: Print
km: បោះពុម្ព

source: Text Size
km: ទំហំអក្សរ

# textSizeSmall
source: Small
km: តូច

# textSizeMedium
source: Medium
km: មធ្យម

# textSizeLarge
source: Large
km: ធំ

# dashboardWelcome
source: What would you like to do?
km: តើអ្នកចង់ធ្វើអ្វី?

source: My Documents
km: ឯកសារខ្ញុំ

# myDocumentsDescription
source: View and manage scanned files
km: មើល និងគ្រប់គ្រងឯកសារដែលបានស្កេន

# scanDocumentDescription
source: Digitize papers and receipts
km: ស្កេនក្រដាស និងបង្កាន់ដៃ

source: Scan Product
km: ស្កេនផលិតផល

# scanProductDescription
source: Barcode & QR Code reader
km: អានកូដ Barcode និង QR

# moreFeatures
source: More Soon
km: មុខងារបន្ថែម

# moreFeaturesDescription
source: New tools are coming
km: មុខងារថ្មីៗនឹងមកដល់ឆាប់ៗ

# productScanComingSoonDescription
source: Barcode and QR code scanning will be available in a future update.
km: មុខងារស្កេន Barcode និង QR នឹងមានក្នុងការអាប់ដេតនាពេលអនាគត។

# greetingMorning
source: Good Morning!
km: អរុណសួស្តី!

# greetingAfternoon
source: Good Afternoon!
km: ទិវាសួស្តី!

# greetingEvening
source: Good Evening!
km: សាយ័ណសួស្តី!

# greetingNight
source: Good Night!
km: រាត្រីសួស្តី!

# dashboardFeatures
source: Features
km: មុខងារ

source: Scroll for more
km: រំកិលដើម្បីមើលបន្ថែម

# dragToReorder
source: Long press and drag to reorder images
km: ចុចឱ្យជាប់ រួចអូសដើម្បីរៀបចំលំដាប់រូបភាព

# chooseImageSource
source: Add Document
km: បន្ថែមឯកសារ

# scanDocumentOption
source: Scan Document
km: ស្កេនឯកសារ

# scanDocumentOptionDescription
source: Use camera to scan multiple pages
km: ប្រើកាមេរ៉ាដើម្បីស្កេនច្រើនទំព័រ

# scanModeBarcode
source: Barcode
km: បាកូដ

# scanModeVisual
source: Visual
km: រូបភាព

source: Copy Text
km: ចម្លងអត្ថបទ

source: Khmer OCR
km: ស្កេនអក្សរខ្មែរ

source: Extract text from images
km: ទាញយកអត្ថបទពីរូបភាព

source: Coming Soon
km: ឆាប់ៗនេះ

# comingSoonDescription
source: More exciting features
km: មុខងារថ្មីៗជាច្រើនទៀត

# copiedToClipboard
source: Text copied to clipboard
km: បានចម្លងទៅក្ដារតម្បៀតខ្ទាស់
